#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonCrawler

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DungeonCrawler_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "ReplicationGraph_classes.hpp"
#include "InputCore_structs.hpp"
#include "GeometryCollectionEngine_classes.hpp"
#include "CommonInput_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "EngineSettings_classes.hpp"


namespace SDK
{

// Class DungeonCrawler.DCDataAssetBase
// 0x0018 (0x0048 - 0x0030)
class UDCDataAssetBase : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_2346[0x10];                                    // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      AssetType;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCDataAssetBase">();
	}
	static class UDCDataAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCDataAssetBase>();
	}
};
static_assert(alignof(UDCDataAssetBase) == 0x000008, "Wrong alignment on UDCDataAssetBase");
static_assert(sizeof(UDCDataAssetBase) == 0x000048, "Wrong size on UDCDataAssetBase");
static_assert(offsetof(UDCDataAssetBase, AssetType) == 0x000040, "Member 'UDCDataAssetBase::AssetType' has a wrong offset!");

// Class DungeonCrawler.DesignDataAssetItemConsume
// 0x0020 (0x0068 - 0x0048)
class UDesignDataAssetItemConsume final : public UDCDataAssetBase
{
public:
	struct FDesignDataItemConsume                 Item;                                              // 0x0048(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignDataAssetItemConsume">();
	}
	static class UDesignDataAssetItemConsume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataAssetItemConsume>();
	}
};
static_assert(alignof(UDesignDataAssetItemConsume) == 0x000008, "Wrong alignment on UDesignDataAssetItemConsume");
static_assert(sizeof(UDesignDataAssetItemConsume) == 0x000068, "Wrong size on UDesignDataAssetItemConsume");
static_assert(offsetof(UDesignDataAssetItemConsume, Item) == 0x000048, "Member 'UDesignDataAssetItemConsume::Item' has a wrong offset!");

// Class DungeonCrawler.AccountLink
// 0x02C0 (0x02E8 - 0x0028)
class UAccountLink final : public UObject
{
public:
	uint8                                         Pad_2347[0x2C0];                                   // 0x0028(0x02C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastMsgBlueprint(const int32& InMsg);
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccountLink">();
	}
	static class UAccountLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountLink>();
	}
};
static_assert(alignof(UAccountLink) == 0x000008, "Wrong alignment on UAccountLink");
static_assert(sizeof(UAccountLink) == 0x0002E8, "Wrong size on UAccountLink");

// Class DungeonCrawler.ArtDataBase
// 0x0000 (0x0048 - 0x0048)
class UArtDataBase : public UDCDataAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArtDataBase">();
	}
	static class UArtDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtDataBase>();
	}
};
static_assert(alignof(UArtDataBase) == 0x000008, "Wrong alignment on UArtDataBase");
static_assert(sizeof(UArtDataBase) == 0x000048, "Wrong size on UArtDataBase");

// Class DungeonCrawler.DCCharacterPartsArtData
// 0x0140 (0x0188 - 0x0048)
class UDCCharacterPartsArtData : public UArtDataBase
{
public:
	TMap<EDCCharacterPart, class USkeletalMesh*>  BodyParts;                                         // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<EDCCharacterPart, class USkeletalMesh*>  DefaultParts;                                      // 0x0098(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FDCHitboxData>       HitBoxOverridesWithTypes;                          // 0x00E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<EDCMorphTarget, float>                   MorphTargets;                                      // 0x0138(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCCharacterPartsArtData">();
	}
	static class UDCCharacterPartsArtData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCCharacterPartsArtData>();
	}
};
static_assert(alignof(UDCCharacterPartsArtData) == 0x000008, "Wrong alignment on UDCCharacterPartsArtData");
static_assert(sizeof(UDCCharacterPartsArtData) == 0x000188, "Wrong size on UDCCharacterPartsArtData");
static_assert(offsetof(UDCCharacterPartsArtData, BodyParts) == 0x000048, "Member 'UDCCharacterPartsArtData::BodyParts' has a wrong offset!");
static_assert(offsetof(UDCCharacterPartsArtData, DefaultParts) == 0x000098, "Member 'UDCCharacterPartsArtData::DefaultParts' has a wrong offset!");
static_assert(offsetof(UDCCharacterPartsArtData, HitBoxOverridesWithTypes) == 0x0000E8, "Member 'UDCCharacterPartsArtData::HitBoxOverridesWithTypes' has a wrong offset!");
static_assert(offsetof(UDCCharacterPartsArtData, MorphTargets) == 0x000138, "Member 'UDCCharacterPartsArtData::MorphTargets' has a wrong offset!");

// Class DungeonCrawler.DCCharacterSkinArtData
// 0x0060 (0x01E8 - 0x0188)
class UDCCharacterSkinArtData final : public UDCCharacterPartsArtData
{
public:
	class UTexture2D*                             CharacterSkinIconTexture;                          // 0x0188(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDCCharacterModifyBoneData             CharacterModifyBoneData;                           // 0x0190(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCCharacterSkinArtData">();
	}
	static class UDCCharacterSkinArtData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCCharacterSkinArtData>();
	}
};
static_assert(alignof(UDCCharacterSkinArtData) == 0x000008, "Wrong alignment on UDCCharacterSkinArtData");
static_assert(sizeof(UDCCharacterSkinArtData) == 0x0001E8, "Wrong size on UDCCharacterSkinArtData");
static_assert(offsetof(UDCCharacterSkinArtData, CharacterSkinIconTexture) == 0x000188, "Member 'UDCCharacterSkinArtData::CharacterSkinIconTexture' has a wrong offset!");
static_assert(offsetof(UDCCharacterSkinArtData, CharacterModifyBoneData) == 0x000190, "Member 'UDCCharacterSkinArtData::CharacterModifyBoneData' has a wrong offset!");

// Class DungeonCrawler.AccountLinkAll
// 0x00B0 (0x00D8 - 0x0028)
class UAccountLinkAll final : public UObject
{
public:
	uint8                                         Pad_2348[0xB0];                                    // 0x0028(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastMsgBlueprint(const int32& InMsg);
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccountLinkAll">();
	}
	static class UAccountLinkAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountLinkAll>();
	}
};
static_assert(alignof(UAccountLinkAll) == 0x000008, "Wrong alignment on UAccountLinkAll");
static_assert(sizeof(UAccountLinkAll) == 0x0000D8, "Wrong size on UAccountLinkAll");

// Class DungeonCrawler.AccountSession
// 0x0178 (0x01A0 - 0x0028)
class UAccountSession final : public UObject
{
public:
	uint8                                         Pad_2349[0x58];                                    // 0x0028(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseObject*                            BaseObject;                                        // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_234A[0x118];                                   // 0x0088(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastMsgBlueprint(const int32& InMsg);
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccountSession">();
	}
	static class UAccountSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountSession>();
	}
};
static_assert(alignof(UAccountSession) == 0x000008, "Wrong alignment on UAccountSession");
static_assert(sizeof(UAccountSession) == 0x0001A0, "Wrong size on UAccountSession");
static_assert(offsetof(UAccountSession, BaseObject) == 0x000080, "Member 'UAccountSession::BaseObject' has a wrong offset!");

// Class DungeonCrawler.DCWidgetBase
// 0x0070 (0x0358 - 0x02E8)
class UDCWidgetBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_234B[0x60];                                    // 0x02E8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseObject*                            BaseObject;                                        // 0x0348(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundData*                             SoundData;                                         // 0x0350(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindMsgOwner(class UScriptStruct* InMsgType, class UBindMsgNode* InMsgDynamicDelegate);
	void BroadcastMsgBlueprint(const int32& InMsg);
	TScriptInterface<class IBaseInterface> GetOwningBaseInterfaceBlueprint();
	bool IsSpectating();
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);
	void UnbindMsgAllOwner();
	void UnbindMsgOwner(class UScriptStruct* InMsgType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCWidgetBase">();
	}
	static class UDCWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCWidgetBase>();
	}
};
static_assert(alignof(UDCWidgetBase) == 0x000008, "Wrong alignment on UDCWidgetBase");
static_assert(sizeof(UDCWidgetBase) == 0x000358, "Wrong size on UDCWidgetBase");
static_assert(offsetof(UDCWidgetBase, BaseObject) == 0x000348, "Member 'UDCWidgetBase::BaseObject' has a wrong offset!");
static_assert(offsetof(UDCWidgetBase, SoundData) == 0x000350, "Member 'UDCWidgetBase::SoundData' has a wrong offset!");

// Class DungeonCrawler.DCPlayerCharacterBasedWidget
// 0x0028 (0x0380 - 0x0358)
class UDCPlayerCharacterBasedWidget : public UDCWidgetBase
{
public:
	struct FDCAccountId                           AccountId;                                         // 0x0358(0x0010)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACharacter*                             PlayerCharacter;                                   // 0x0368(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDCInventoryComponent*                  InventoryComponent;                                // 0x0370(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDCEquipmentComponent*                  EquipmentComponent;                                // 0x0378(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCPlayerCharacterBasedWidget">();
	}
	static class UDCPlayerCharacterBasedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCPlayerCharacterBasedWidget>();
	}
};
static_assert(alignof(UDCPlayerCharacterBasedWidget) == 0x000008, "Wrong alignment on UDCPlayerCharacterBasedWidget");
static_assert(sizeof(UDCPlayerCharacterBasedWidget) == 0x000380, "Wrong size on UDCPlayerCharacterBasedWidget");
static_assert(offsetof(UDCPlayerCharacterBasedWidget, AccountId) == 0x000358, "Member 'UDCPlayerCharacterBasedWidget::AccountId' has a wrong offset!");
static_assert(offsetof(UDCPlayerCharacterBasedWidget, PlayerCharacter) == 0x000368, "Member 'UDCPlayerCharacterBasedWidget::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UDCPlayerCharacterBasedWidget, InventoryComponent) == 0x000370, "Member 'UDCPlayerCharacterBasedWidget::InventoryComponent' has a wrong offset!");
static_assert(offsetof(UDCPlayerCharacterBasedWidget, EquipmentComponent) == 0x000378, "Member 'UDCPlayerCharacterBasedWidget::EquipmentComponent' has a wrong offset!");

// Class DungeonCrawler.DCInventoryWidgetBase
// 0x0060 (0x03E0 - 0x0380)
class UDCInventoryWidgetBase : public UDCPlayerCharacterBasedWidget
{
public:
	uint8                                         Pad_234C[0x48];                                    // 0x0380(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bReadOnly;                                         // 0x03C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_234D[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDCInventoryWidgetBase*>         ChildInventoryWidgets;                             // 0x03D0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCInventoryWidgetBase">();
	}
	static class UDCInventoryWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCInventoryWidgetBase>();
	}
};
static_assert(alignof(UDCInventoryWidgetBase) == 0x000008, "Wrong alignment on UDCInventoryWidgetBase");
static_assert(sizeof(UDCInventoryWidgetBase) == 0x0003E0, "Wrong size on UDCInventoryWidgetBase");
static_assert(offsetof(UDCInventoryWidgetBase, bReadOnly) == 0x0003C8, "Member 'UDCInventoryWidgetBase::bReadOnly' has a wrong offset!");
static_assert(offsetof(UDCInventoryWidgetBase, ChildInventoryWidgets) == 0x0003D0, "Member 'UDCInventoryWidgetBase::ChildInventoryWidgets' has a wrong offset!");

// Class DungeonCrawler.DCTradeInventoryWidget
// 0x0008 (0x03E8 - 0x03E0)
class UDCTradeInventoryWidget final : public UDCInventoryWidgetBase
{
public:
	class UDCInventorySetWidget*                  InventorySetWidget;                                // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnTradeEnd();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCTradeInventoryWidget">();
	}
	static class UDCTradeInventoryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCTradeInventoryWidget>();
	}
};
static_assert(alignof(UDCTradeInventoryWidget) == 0x000008, "Wrong alignment on UDCTradeInventoryWidget");
static_assert(sizeof(UDCTradeInventoryWidget) == 0x0003E8, "Wrong size on UDCTradeInventoryWidget");
static_assert(offsetof(UDCTradeInventoryWidget, InventorySetWidget) == 0x0003E0, "Member 'UDCTradeInventoryWidget::InventorySetWidget' has a wrong offset!");

// Class DungeonCrawler.DCInventoryBase
// 0x0288 (0x02B0 - 0x0028)
class UDCInventoryBase : public UObject
{
public:
	uint8                                         Pad_234E[0x30];                                    // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	EDCInventoryId                                InventoryId;                                       // 0x0058(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_234F[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Indexes;                                           // 0x0060(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FDCItemId>                 KeyByIndex;                                        // 0x0070(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FDCItemId, struct FDCItemInfo>    Values;                                            // 0x00C0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 OwnerCharacter;                                    // 0x0110(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDCInventoryData                       InventoryData;                                     // 0x0118(0x0120)(Net, Protected, NativeAccessSpecifierProtected)
	TMap<EDCInventoryValidatorType, class UDCInventoryValidatorBase*> Validators;                                        // 0x0238(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FDCInventoryVersion                    Version;                                           // 0x0288(0x0028)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_Indexes(const TArray<int32>& OldIndexes);
	void OnRep_Version(const struct FDCInventoryVersion& OldVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCInventoryBase">();
	}
	static class UDCInventoryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCInventoryBase>();
	}
};
static_assert(alignof(UDCInventoryBase) == 0x000008, "Wrong alignment on UDCInventoryBase");
static_assert(sizeof(UDCInventoryBase) == 0x0002B0, "Wrong size on UDCInventoryBase");
static_assert(offsetof(UDCInventoryBase, InventoryId) == 0x000058, "Member 'UDCInventoryBase::InventoryId' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, Indexes) == 0x000060, "Member 'UDCInventoryBase::Indexes' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, KeyByIndex) == 0x000070, "Member 'UDCInventoryBase::KeyByIndex' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, Values) == 0x0000C0, "Member 'UDCInventoryBase::Values' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, OwnerCharacter) == 0x000110, "Member 'UDCInventoryBase::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, InventoryData) == 0x000118, "Member 'UDCInventoryBase::InventoryData' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, Validators) == 0x000238, "Member 'UDCInventoryBase::Validators' has a wrong offset!");
static_assert(offsetof(UDCInventoryBase, Version) == 0x000288, "Member 'UDCInventoryBase::Version' has a wrong offset!");

// Class DungeonCrawler.DCBoxInventory
// 0x0008 (0x02B8 - 0x02B0)
class UDCBoxInventory final : public UDCInventoryBase
{
public:
	struct FIntPoint                              BoxSize;                                           // 0x02B0(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_BoxSize(const struct FIntPoint& OldBoxSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCBoxInventory">();
	}
	static class UDCBoxInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCBoxInventory>();
	}
};
static_assert(alignof(UDCBoxInventory) == 0x000008, "Wrong alignment on UDCBoxInventory");
static_assert(sizeof(UDCBoxInventory) == 0x0002B8, "Wrong size on UDCBoxInventory");
static_assert(offsetof(UDCBoxInventory, BoxSize) == 0x0002B0, "Member 'UDCBoxInventory::BoxSize' has a wrong offset!");

// Class DungeonCrawler.GameMenuOptionsVideosSlotWidget
// 0x0010 (0x0368 - 0x0358)
class UGameMenuOptionsVideosSlotWidget final : public UDCWidgetBase
{
public:
	class UTextBlock*                             Title;                                             // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2350[0x8];                                     // 0x0360(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetQualityLevel();
	void OnEpicButtonClicked();
	void OnExtraButtonClicked();
	void OnHighButtonClicked();
	void OnLowButtonClicked();
	void OnMediumButtonClicked();
	void OnQualityLevel(const int32& NewValue, const int32& OldValue);
	void SetQualityLevel(int32 InQualityLevel);
	void SetTitle(const class FText& InTitle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameMenuOptionsVideosSlotWidget">();
	}
	static class UGameMenuOptionsVideosSlotWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameMenuOptionsVideosSlotWidget>();
	}
};
static_assert(alignof(UGameMenuOptionsVideosSlotWidget) == 0x000008, "Wrong alignment on UGameMenuOptionsVideosSlotWidget");
static_assert(sizeof(UGameMenuOptionsVideosSlotWidget) == 0x000368, "Wrong size on UGameMenuOptionsVideosSlotWidget");
static_assert(offsetof(UGameMenuOptionsVideosSlotWidget, Title) == 0x000358, "Member 'UGameMenuOptionsVideosSlotWidget::Title' has a wrong offset!");

// Class DungeonCrawler.ActorStatusUIData
// 0x0008 (0x0050 - 0x0048)
class UActorStatusUIData final : public UDCDataAssetBase
{
public:
	class UTexture2D*                             IconTexture;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorStatusUIData">();
	}
	static class UActorStatusUIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorStatusUIData>();
	}
};
static_assert(alignof(UActorStatusUIData) == 0x000008, "Wrong alignment on UActorStatusUIData");
static_assert(sizeof(UActorStatusUIData) == 0x000050, "Wrong size on UActorStatusUIData");
static_assert(offsetof(UActorStatusUIData, IconTexture) == 0x000048, "Member 'UActorStatusUIData::IconTexture' has a wrong offset!");

// Class DungeonCrawler.DCTagCollisionDetectorComponent
// 0x0060 (0x0610 - 0x05B0)
class UDCTagCollisionDetectorComponent final : public UBoxComponent
{
public:
	FMulticastInlineDelegateProperty_             OnGameplayTagCollisionDetected;                    // 0x05B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      GameplayTagQuery;                                  // 0x05C0(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2351[0x8];                                     // 0x0608(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCTagCollisionDetectorComponent">();
	}
	static class UDCTagCollisionDetectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCTagCollisionDetectorComponent>();
	}
};
static_assert(alignof(UDCTagCollisionDetectorComponent) == 0x000010, "Wrong alignment on UDCTagCollisionDetectorComponent");
static_assert(sizeof(UDCTagCollisionDetectorComponent) == 0x000610, "Wrong size on UDCTagCollisionDetectorComponent");
static_assert(offsetof(UDCTagCollisionDetectorComponent, OnGameplayTagCollisionDetected) == 0x0005B0, "Member 'UDCTagCollisionDetectorComponent::OnGameplayTagCollisionDetected' has a wrong offset!");
static_assert(offsetof(UDCTagCollisionDetectorComponent, GameplayTagQuery) == 0x0005C0, "Member 'UDCTagCollisionDetectorComponent::GameplayTagQuery' has a wrong offset!");

// Class DungeonCrawler.DCUserInfoManagerBase
// 0x0008 (0x0030 - 0x0028)
class UDCUserInfoManagerBase : public UObject
{
public:
	uint8                                         Pad_2352[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCUserInfoManagerBase">();
	}
	static class UDCUserInfoManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCUserInfoManagerBase>();
	}
};
static_assert(alignof(UDCUserInfoManagerBase) == 0x000008, "Wrong alignment on UDCUserInfoManagerBase");
static_assert(sizeof(UDCUserInfoManagerBase) == 0x000030, "Wrong size on UDCUserInfoManagerBase");

// Class DungeonCrawler.DCDeathCamManager
// 0x00D0 (0x0100 - 0x0030)
class UDCDeathCamManager final : public UDCUserInfoManagerBase
{
public:
	uint8                                         Pad_2353[0xD0];                                    // 0x0030(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCDeathCamManager">();
	}
	static class UDCDeathCamManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCDeathCamManager>();
	}
};
static_assert(alignof(UDCDeathCamManager) == 0x000008, "Wrong alignment on UDCDeathCamManager");
static_assert(sizeof(UDCDeathCamManager) == 0x000100, "Wrong size on UDCDeathCamManager");

// Class DungeonCrawler.DesignDataAssetItemPropertyType
// 0x0060 (0x00A8 - 0x0048)
class UDesignDataAssetItemPropertyType final : public UDCDataAssetBase
{
public:
	struct FDesignDataItemPropertyType            Item;                                              // 0x0048(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignDataAssetItemPropertyType">();
	}
	static class UDesignDataAssetItemPropertyType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataAssetItemPropertyType>();
	}
};
static_assert(alignof(UDesignDataAssetItemPropertyType) == 0x000008, "Wrong alignment on UDesignDataAssetItemPropertyType");
static_assert(sizeof(UDesignDataAssetItemPropertyType) == 0x0000A8, "Wrong size on UDesignDataAssetItemPropertyType");
static_assert(offsetof(UDesignDataAssetItemPropertyType, Item) == 0x000048, "Member 'UDesignDataAssetItemPropertyType::Item' has a wrong offset!");

// Class DungeonCrawler.ArenaSelectSlotWidget
// 0x0030 (0x0388 - 0x0358)
class UArenaSelectSlotWidget final : public UDCWidgetBase
{
public:
	EGameType                                     ArenaGameType;                                     // 0x0358(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2354[0x3];                                     // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ArenaDungeonIdTag;                                 // 0x035C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2355[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDungeonSelectSlotButtonWidget*         ArenaButton;                                       // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             ArenaSelectSlotDelegate;                           // 0x0370(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EGameType                                     CurGameType;                                       // 0x0380(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2356[0x7];                                     // 0x0381(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnArenaButtonClicked();
	void OnGameUserSettingControlsChanged(const struct FGameUserSettingControls& InGameUserSettingControls, const struct FGameUserSettingControls& InOldGameUserSettingControls, bool bInForce);
	void UpdateArenaSelectSlot();

	bool CanJoin() const;
	struct FDateTime GetBeginTime() const;
	struct FDateTime GetEndTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArenaSelectSlotWidget">();
	}
	static class UArenaSelectSlotWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArenaSelectSlotWidget>();
	}
};
static_assert(alignof(UArenaSelectSlotWidget) == 0x000008, "Wrong alignment on UArenaSelectSlotWidget");
static_assert(sizeof(UArenaSelectSlotWidget) == 0x000388, "Wrong size on UArenaSelectSlotWidget");
static_assert(offsetof(UArenaSelectSlotWidget, ArenaGameType) == 0x000358, "Member 'UArenaSelectSlotWidget::ArenaGameType' has a wrong offset!");
static_assert(offsetof(UArenaSelectSlotWidget, ArenaDungeonIdTag) == 0x00035C, "Member 'UArenaSelectSlotWidget::ArenaDungeonIdTag' has a wrong offset!");
static_assert(offsetof(UArenaSelectSlotWidget, ArenaButton) == 0x000368, "Member 'UArenaSelectSlotWidget::ArenaButton' has a wrong offset!");
static_assert(offsetof(UArenaSelectSlotWidget, ArenaSelectSlotDelegate) == 0x000370, "Member 'UArenaSelectSlotWidget::ArenaSelectSlotDelegate' has a wrong offset!");
static_assert(offsetof(UArenaSelectSlotWidget, CurGameType) == 0x000380, "Member 'UArenaSelectSlotWidget::CurGameType' has a wrong offset!");

// Class DungeonCrawler.DCGameModeAIControllerBase
// 0x0070 (0x0430 - 0x03C0)
class ADCGameModeAIControllerBase : public AAIController
{
public:
	uint8                                         Pad_2358[0x70];                                    // 0x03C0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastMsgBlueprint(const int32& InMsg);
	void ReceivePreInitializeComponents();
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCGameModeAIControllerBase">();
	}
	static class ADCGameModeAIControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADCGameModeAIControllerBase>();
	}
};
static_assert(alignof(ADCGameModeAIControllerBase) == 0x000008, "Wrong alignment on ADCGameModeAIControllerBase");
static_assert(sizeof(ADCGameModeAIControllerBase) == 0x000430, "Wrong size on ADCGameModeAIControllerBase");

// Class DungeonCrawler.DCGameModeAIControllerGameBase
// 0x0008 (0x0438 - 0x0430)
class ADCGameModeAIControllerGameBase : public ADCGameModeAIControllerBase
{
public:
	class UAccountLinkAll*                        AccountLinkAll;                                    // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCGameModeAIControllerGameBase">();
	}
	static class ADCGameModeAIControllerGameBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADCGameModeAIControllerGameBase>();
	}
};
static_assert(alignof(ADCGameModeAIControllerGameBase) == 0x000008, "Wrong alignment on ADCGameModeAIControllerGameBase");
static_assert(sizeof(ADCGameModeAIControllerGameBase) == 0x000438, "Wrong size on ADCGameModeAIControllerGameBase");
static_assert(offsetof(ADCGameModeAIControllerGameBase, AccountLinkAll) == 0x000430, "Member 'ADCGameModeAIControllerGameBase::AccountLinkAll' has a wrong offset!");

// Class DungeonCrawler.DCGameModeAIControllerTestBase
// 0x0000 (0x0438 - 0x0438)
class ADCGameModeAIControllerTestBase final : public ADCGameModeAIControllerGameBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCGameModeAIControllerTestBase">();
	}
	static class ADCGameModeAIControllerTestBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADCGameModeAIControllerTestBase>();
	}
};
static_assert(alignof(ADCGameModeAIControllerTestBase) == 0x000008, "Wrong alignment on ADCGameModeAIControllerTestBase");
static_assert(sizeof(ADCGameModeAIControllerTestBase) == 0x000438, "Wrong size on ADCGameModeAIControllerTestBase");

// Class DungeonCrawler.DCGameplayAbilityBase
// 0x01E8 (0x05A0 - 0x03B8)
class UDCGameplayAbilityBase : public UGameplayAbility
{
public:
	uint8                                         Pad_2359[0xE0];                                    // 0x03B8(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDCGameplayEffectContainer>     EffectContainerArray;                              // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FDCGameplayEffectData>          OverrideGameplayEffectDataArray;                   // 0x04A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>    ActiveEffectHandles;                               // 0x04B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           IdleAnimSequenceGameplayTag;                       // 0x04C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDesignDataMovementModifier>    MovementModifierArray;                             // 0x04D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDesignDataMovementModifier>    DefaultMovementModifierArray;                      // 0x04E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryAssetId>                AdditionalMovementModifierIds;                     // 0x04F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        AbilityId;                                         // 0x0500(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDesignDataGameplayAbility             DesignDataGameplayAbility;                         // 0x0510(0x0068)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  AppliedMovementModifierTags;                       // 0x0578(0x0020)(NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultMovementModifierApplied;                 // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_235A[0x7];                                     // 0x0599(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& EffectContext);
	void AddGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& EffectContext);
	void AddGameplayCueLocalWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& Params_0);
	void AddGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& Params_0);
	TArray<struct FActiveGameplayEffectHandle> ApplyEffectContainer(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData, int32 OverrideGameplayLevel, int32 InCountToApply, bool bIsApplyTargetSelf);
	TArray<struct FActiveGameplayEffectHandle> ApplyEffectContainerSpec(const struct FDCGameplayEffectContainerSpec& ContainerSpec, int32 InCountToApply, bool bIsApplyTargetSelf);
	TArray<struct FActiveGameplayEffectHandle> ApplyEffectContainerSpecArray(TArray<struct FDCGameplayEffectContainerSpec>& OutContainerSpecArray, const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);
	void ApplyMovementModifier(const struct FGameplayTag& EventTag);
	TArray<struct FActiveGameplayEffectHandle> ApplyPremadeSpecArray(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);
	void CopyPremadeSpecArray(class AActor* InActor);
	void ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& EffectContext);
	void ExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& EffectContext);
	void ExecuteGameplayCueLocalWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& Params_0);
	void ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& Params_0);
	struct FGameplayTagContainer GetEffectAssetTagsInEffectContainerArray(const struct FGameplayTag& InContainerTag);
	struct FGameplayTag GetGameplayTriggerTag(int32 Param_Index);
	int32 GetSetByCallerValueInEffectContainerArray(const struct FGameplayTag& ContainerTag, const struct FGameplayTag& SetByCallerDataTag);
	void MakeEffectContainerPremadeSpec(class AActor* InActor, const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData, int32 OverrideGameplayLevel);
	void MakeEffectContainerSpec(TArray<struct FDCGameplayEffectContainerSpec>* OutContainerSpecArray, const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData, int32 OverrideGameplayLevel);
	void MakeEffectContainerSpecFromContainer(TArray<struct FDCGameplayEffectContainerSpec>& OutContainerSpecArray, const struct FDCGameplayEffectContainer& Container, const struct FGameplayEventData& EventData, int32 OverrideGameplayLevel);
	void RemoveAllAppliedMovementModifiers();
	void RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	void RemoveGameplayCueLocal(const struct FGameplayTag& GameplayCueTag);
	void RemoveMovementModifier(const struct FGameplayTag& EventTag);

	const bool HasMovementModifier(const struct FGameplayTag& EventTag) const;
	const bool IsMovementModifierApplied(const struct FGameplayTag& EventTag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCGameplayAbilityBase">();
	}
	static class UDCGameplayAbilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCGameplayAbilityBase>();
	}
};
static_assert(alignof(UDCGameplayAbilityBase) == 0x000008, "Wrong alignment on UDCGameplayAbilityBase");
static_assert(sizeof(UDCGameplayAbilityBase) == 0x0005A0, "Wrong size on UDCGameplayAbilityBase");
static_assert(offsetof(UDCGameplayAbilityBase, EffectContainerArray) == 0x000498, "Member 'UDCGameplayAbilityBase::EffectContainerArray' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, OverrideGameplayEffectDataArray) == 0x0004A8, "Member 'UDCGameplayAbilityBase::OverrideGameplayEffectDataArray' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, ActiveEffectHandles) == 0x0004B8, "Member 'UDCGameplayAbilityBase::ActiveEffectHandles' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, IdleAnimSequenceGameplayTag) == 0x0004C8, "Member 'UDCGameplayAbilityBase::IdleAnimSequenceGameplayTag' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, MovementModifierArray) == 0x0004D0, "Member 'UDCGameplayAbilityBase::MovementModifierArray' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, DefaultMovementModifierArray) == 0x0004E0, "Member 'UDCGameplayAbilityBase::DefaultMovementModifierArray' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, AdditionalMovementModifierIds) == 0x0004F0, "Member 'UDCGameplayAbilityBase::AdditionalMovementModifierIds' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, AbilityId) == 0x000500, "Member 'UDCGameplayAbilityBase::AbilityId' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, DesignDataGameplayAbility) == 0x000510, "Member 'UDCGameplayAbilityBase::DesignDataGameplayAbility' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, AppliedMovementModifierTags) == 0x000578, "Member 'UDCGameplayAbilityBase::AppliedMovementModifierTags' has a wrong offset!");
static_assert(offsetof(UDCGameplayAbilityBase, bIsDefaultMovementModifierApplied) == 0x000598, "Member 'UDCGameplayAbilityBase::bIsDefaultMovementModifierApplied' has a wrong offset!");

// Class DungeonCrawler.GA_Interact
// 0x0170 (0x0710 - 0x05A0)
class UGA_Interact : public UDCGameplayAbilityBase
{
public:
	class UAnimMontage*                           MontageToPlayBothHandEquipped;                     // 0x05A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           MontageToPlayPrimaryEquipped;                      // 0x05A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           MontageToPlaySecondaryEquipped;                    // 0x05B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           MontageToPlayPrimaryEquippedInstant;               // 0x05B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           MontageToPlaySecondaryEquippedInstant;             // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TwoHandRightHandedItems;                           // 0x05C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UDCAT_WaitDelayPausable*                WaitDelayPausableTask;                             // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRandomStream                          Stream;                                            // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FInteractionData                       CurrentData;                                       // 0x05F8(0x00B8)(Protected, NativeAccessSpecifierProtected)
	struct FDesignDataPropsSkillCheck             CurrentSkillCheckData;                             // 0x06B0(0x0030)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CurrentInteractTag;                                // 0x06E0(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CurrentStateTag;                                   // 0x06E8(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 InteractTargetActor;                               // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2362[0x18];                                    // 0x06F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EventReceived(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	bool IsValidData(const struct FGameplayEventData& EventData);
	void OnAimDirectionChange();
	void OnCancelled();
	void OnDetectUnableInteraction();
	void OnEndSync();
	void OnFinish();
	void OnInteractBlockTagAdded();
	void OnPause();
	void OnResume();
	void OnSkillCheck();
	void OnSkillCheckFailed();
	void OnSkillCheckFinished(ESkillCheckResult Result);
	void OnSkillCheckPerfectSucceed();
	void OnSkillCheckSucceed();
	void OnStartDelayFinished();
	void OnStartSync();
	void OnVelocityChange();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GA_Interact">();
	}
	static class UGA_Interact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Interact>();
	}
};
static_assert(alignof(UGA_Interact) == 0x000008, "Wrong alignment on UGA_Interact");
static_assert(sizeof(UGA_Interact) == 0x000710, "Wrong size on UGA_Interact");
static_assert(offsetof(UGA_Interact, MontageToPlayBothHandEquipped) == 0x0005A0, "Member 'UGA_Interact::MontageToPlayBothHandEquipped' has a wrong offset!");
static_assert(offsetof(UGA_Interact, MontageToPlayPrimaryEquipped) == 0x0005A8, "Member 'UGA_Interact::MontageToPlayPrimaryEquipped' has a wrong offset!");
static_assert(offsetof(UGA_Interact, MontageToPlaySecondaryEquipped) == 0x0005B0, "Member 'UGA_Interact::MontageToPlaySecondaryEquipped' has a wrong offset!");
static_assert(offsetof(UGA_Interact, MontageToPlayPrimaryEquippedInstant) == 0x0005B8, "Member 'UGA_Interact::MontageToPlayPrimaryEquippedInstant' has a wrong offset!");
static_assert(offsetof(UGA_Interact, MontageToPlaySecondaryEquippedInstant) == 0x0005C0, "Member 'UGA_Interact::MontageToPlaySecondaryEquippedInstant' has a wrong offset!");
static_assert(offsetof(UGA_Interact, TwoHandRightHandedItems) == 0x0005C8, "Member 'UGA_Interact::TwoHandRightHandedItems' has a wrong offset!");
static_assert(offsetof(UGA_Interact, WaitDelayPausableTask) == 0x0005E8, "Member 'UGA_Interact::WaitDelayPausableTask' has a wrong offset!");
static_assert(offsetof(UGA_Interact, Stream) == 0x0005F0, "Member 'UGA_Interact::Stream' has a wrong offset!");
static_assert(offsetof(UGA_Interact, CurrentData) == 0x0005F8, "Member 'UGA_Interact::CurrentData' has a wrong offset!");
static_assert(offsetof(UGA_Interact, CurrentSkillCheckData) == 0x0006B0, "Member 'UGA_Interact::CurrentSkillCheckData' has a wrong offset!");
static_assert(offsetof(UGA_Interact, CurrentInteractTag) == 0x0006E0, "Member 'UGA_Interact::CurrentInteractTag' has a wrong offset!");
static_assert(offsetof(UGA_Interact, CurrentStateTag) == 0x0006E8, "Member 'UGA_Interact::CurrentStateTag' has a wrong offset!");
static_assert(offsetof(UGA_Interact, InteractTargetActor) == 0x0006F0, "Member 'UGA_Interact::InteractTargetActor' has a wrong offset!");

// Class DungeonCrawler.GA_HuntingTrapDisarmInteract
// 0x0000 (0x0710 - 0x0710)
class UGA_HuntingTrapDisarmInteract : public UGA_Interact
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GA_HuntingTrapDisarmInteract">();
	}
	static class UGA_HuntingTrapDisarmInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HuntingTrapDisarmInteract>();
	}
};
static_assert(alignof(UGA_HuntingTrapDisarmInteract) == 0x000008, "Wrong alignment on UGA_HuntingTrapDisarmInteract");
static_assert(sizeof(UGA_HuntingTrapDisarmInteract) == 0x000710, "Wrong size on UGA_HuntingTrapDisarmInteract");

// Class DungeonCrawler.DesignDataAssetShapeShift
// 0x00C8 (0x0110 - 0x0048)
class UDesignDataAssetShapeShift final : public UDCDataAssetBase
{
public:
	struct FDesignDataShapeShift                  Item;                                              // 0x0048(0x00C8)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignDataAssetShapeShift">();
	}
	static class UDesignDataAssetShapeShift* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataAssetShapeShift>();
	}
};
static_assert(alignof(UDesignDataAssetShapeShift) == 0x000008, "Wrong alignment on UDesignDataAssetShapeShift");
static_assert(sizeof(UDesignDataAssetShapeShift) == 0x000110, "Wrong size on UDesignDataAssetShapeShift");
static_assert(offsetof(UDesignDataAssetShapeShift, Item) == 0x000048, "Member 'UDesignDataAssetShapeShift::Item' has a wrong offset!");

// Class DungeonCrawler.ArtDataPlayerCharacter
// 0x0030 (0x0078 - 0x0048)
class UArtDataPlayerCharacter final : public UArtDataBase
{
public:
	class UTexture2D*                             PlayerCharacterIconTexture;                        // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PlayerCharacterIconTextureL;                       // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PlayerCharacterIconTextureXL;                      // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             MasterIconTexture;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PlayerCharacterImageTexture;                       // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PlayerCharacterIllustImageTexture;                 // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArtDataPlayerCharacter">();
	}
	static class UArtDataPlayerCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtDataPlayerCharacter>();
	}
};
static_assert(alignof(UArtDataPlayerCharacter) == 0x000008, "Wrong alignment on UArtDataPlayerCharacter");
static_assert(sizeof(UArtDataPlayerCharacter) == 0x000078, "Wrong size on UArtDataPlayerCharacter");
static_assert(offsetof(UArtDataPlayerCharacter, PlayerCharacterIconTexture) == 0x000048, "Member 'UArtDataPlayerCharacter::PlayerCharacterIconTexture' has a wrong offset!");
static_assert(offsetof(UArtDataPlayerCharacter, PlayerCharacterIconTextureL) == 0x000050, "Member 'UArtDataPlayerCharacter::PlayerCharacterIconTextureL' has a wrong offset!");
static_assert(offsetof(UArtDataPlayerCharacter, PlayerCharacterIconTextureXL) == 0x000058, "Member 'UArtDataPlayerCharacter::PlayerCharacterIconTextureXL' has a wrong offset!");
static_assert(offsetof(UArtDataPlayerCharacter, MasterIconTexture) == 0x000060, "Member 'UArtDataPlayerCharacter::MasterIconTexture' has a wrong offset!");
static_assert(offsetof(UArtDataPlayerCharacter, PlayerCharacterImageTexture) == 0x000068, "Member 'UArtDataPlayerCharacter::PlayerCharacterImageTexture' has a wrong offset!");
static_assert(offsetof(UArtDataPlayerCharacter, PlayerCharacterIllustImageTexture) == 0x000070, "Member 'UArtDataPlayerCharacter::PlayerCharacterIllustImageTexture' has a wrong offset!");

// Class DungeonCrawler.DCActorComponent
// 0x0000 (0x00A0 - 0x00A0)
class UDCActorComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCActorComponent">();
	}
	static class UDCActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCActorComponent>();
	}
};
static_assert(alignof(UDCActorComponent) == 0x000008, "Wrong alignment on UDCActorComponent");
static_assert(sizeof(UDCActorComponent) == 0x0000A0, "Wrong size on UDCActorComponent");

// Class DungeonCrawler.DCExpressmanComponent
// 0x0048 (0x00E8 - 0x00A0)
class UDCExpressmanComponent final : public UDCActorComponent
{
public:
	uint8                                         Pad_2364[0x8];                                     // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultDeliveryCharge;                             // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MinimumDeliveryCharge;                             // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeliveryMagnification;                             // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2365[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDCItemDataAsset*                       AssetItemGoldCoin;                                 // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDCTargetExpressmanData                TargetExpressmanData;                              // 0x00C0(0x0010)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2366[0x18];                                    // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_TargetExpressmanData();
	void ShowSystemMessage_Client(const class FText& InMsg);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCExpressmanComponent">();
	}
	static class UDCExpressmanComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDCExpressmanComponent>();
	}
};
static_assert(alignof(UDCExpressmanComponent) == 0x000008, "Wrong alignment on UDCExpressmanComponent");
static_assert(sizeof(UDCExpressmanComponent) == 0x0000E8, "Wrong size on UDCExpressmanComponent");
static_assert(offsetof(UDCExpressmanComponent, DefaultDeliveryCharge) == 0x0000A8, "Member 'UDCExpressmanComponent::DefaultDeliveryCharge' has a wrong offset!");
static_assert(offsetof(UDCExpressmanComponent, MinimumDeliveryCharge) == 0x0000AC, "Member 'UDCExpressmanComponent::MinimumDeliveryCharge' has a wrong offset!");
static_assert(offsetof(UDCExpressmanComponent, DeliveryMagnification) == 0x0000B0, "Member 'UDCExpressmanComponent::DeliveryMagnification' has a wrong offset!");
static_assert(offsetof(UDCExpressmanComponent, AssetItemGoldCoin) == 0x0000B8, "Member 'UDCExpressmanComponent::AssetItemGoldCoin' has a wrong offset!");
static_assert(offsetof(UDCExpressmanComponent, TargetExpressmanData) == 0x0000C0, "Member 'UDCExpressmanComponent::TargetExpressmanData' has a wrong offset!");

// Class DungeonCrawler.ArtDataMonster
// 0x0008 (0x0050 - 0x0048)
class UArtDataMonster final : public UArtDataBase
{
public:
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArtDataMonster">();
	}
	static class UArtDataMonster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtDataMonster>();
	}
};
static_assert(alignof(UArtDataMonster) == 0x000008, "Wrong alignment on UArtDataMonster");
static_assert(sizeof(UArtDataMonster) == 0x000050, "Wrong size on UArtDataMonster");
static_assert(offsetof(UArtDataMonster, BehaviorTree) == 0x000048, "Member 'UArtDataMonster::BehaviorTree' has a wrong offset!");

// Class DungeonCrawler.ArtDataAoe
// 0x0008 (0x0050 - 0x0048)
class UArtDataAoe final : public UArtDataBase
{
public:
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArtDataAoe">();
	}
	static class UArtDataAoe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtDataAoe>();
	}
};
static_assert(alignof(UArtDataAoe) == 0x000008, "Wrong alignment on UArtDataAoe");
static_assert(sizeof(UArtDataAoe) == 0x000050, "Wrong size on UArtDataAoe");
static_assert(offsetof(UArtDataAoe, BehaviorTree) == 0x000048, "Member 'UArtDataAoe::BehaviorTree' has a wrong offset!");

// Class DungeonCrawler.DCActorBase
// 0x0060 (0x02F8 - 0x0298)
class ADCActorBase : public AActor
{
public:
	uint8                                         Pad_2367[0x58];                                    // 0x0298(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseObject*                            BaseObject;                                        // 0x02F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BroadcastMsgBlueprint(const int32& InMsg);
	bool HasActorBegunPlayBlueprint();
	void ReceivePreInitializeComponents();
	void TerminateBase();
	void UnbindMsg(class UScriptStruct* InMsgType, class UObject* InObject);
	void UnbindMsgAll(class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DCActorBase">();
	}
	static class ADCActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADCActorBase>();
	}
};
static_assert(alignof(ADCActorBase) == 0x000008, "Wrong alignment on ADCActorBase");
static_assert(sizeof(ADCActorBase) == 0x0002F8, "Wrong size on ADCActorBase");
static_assert(offsetof(ADCActorBase, BaseObject) == 0x0002F0, "Member 'ADCActorBase::BaseObject' has a wrong offset!");

// Class DungeonCrawler.DCInteractableActorBase
// 0x0010 (0x0308 - 0x02F8)
class ADCInteractableActorBase : public ADCActorBase
{
public:
	uint8                                         Pad_2368[0x8];                                     // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableTargetComponent*           InteractableTargetComponent;                       // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InteractFailed(class AActor* Interacter, const struct FGameplayTag& EventTag);
	void InteractFound(class AActor* Interacter, class UPrimitiveComponent* InteractPart);
	void InteractLost(class AActor* Interacter);
