#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonCrawler

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DungeonCrawler_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "UMG_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function DungeonCrawler.AccountLink.BroadcastMsgBlueprint
// 0x0004 (0x0004 - 0x0000)
struct AccountLink_BroadcastMsgBlueprint final
{
public:
	int32                                         InMsg;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLink_BroadcastMsgBlueprint) == 0x000004, "Wrong alignment on AccountLink_BroadcastMsgBlueprint");
static_assert(sizeof(AccountLink_BroadcastMsgBlueprint) == 0x000004, "Wrong size on AccountLink_BroadcastMsgBlueprint");
static_assert(offsetof(AccountLink_BroadcastMsgBlueprint, InMsg) == 0x000000, "Member 'AccountLink_BroadcastMsgBlueprint::InMsg' has a wrong offset!");

// Function DungeonCrawler.AccountLink.UnbindMsg
// 0x0010 (0x0010 - 0x0000)
struct AccountLink_UnbindMsg final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLink_UnbindMsg) == 0x000008, "Wrong alignment on AccountLink_UnbindMsg");
static_assert(sizeof(AccountLink_UnbindMsg) == 0x000010, "Wrong size on AccountLink_UnbindMsg");
static_assert(offsetof(AccountLink_UnbindMsg, InMsgType) == 0x000000, "Member 'AccountLink_UnbindMsg::InMsgType' has a wrong offset!");
static_assert(offsetof(AccountLink_UnbindMsg, InObject) == 0x000008, "Member 'AccountLink_UnbindMsg::InObject' has a wrong offset!");

// Function DungeonCrawler.AccountLink.UnbindMsgAll
// 0x0008 (0x0008 - 0x0000)
struct AccountLink_UnbindMsgAll final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLink_UnbindMsgAll) == 0x000008, "Wrong alignment on AccountLink_UnbindMsgAll");
static_assert(sizeof(AccountLink_UnbindMsgAll) == 0x000008, "Wrong size on AccountLink_UnbindMsgAll");
static_assert(offsetof(AccountLink_UnbindMsgAll, InObject) == 0x000000, "Member 'AccountLink_UnbindMsgAll::InObject' has a wrong offset!");

// Function DungeonCrawler.AccountLinkAll.BroadcastMsgBlueprint
// 0x0004 (0x0004 - 0x0000)
struct AccountLinkAll_BroadcastMsgBlueprint final
{
public:
	int32                                         InMsg;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkAll_BroadcastMsgBlueprint) == 0x000004, "Wrong alignment on AccountLinkAll_BroadcastMsgBlueprint");
static_assert(sizeof(AccountLinkAll_BroadcastMsgBlueprint) == 0x000004, "Wrong size on AccountLinkAll_BroadcastMsgBlueprint");
static_assert(offsetof(AccountLinkAll_BroadcastMsgBlueprint, InMsg) == 0x000000, "Member 'AccountLinkAll_BroadcastMsgBlueprint::InMsg' has a wrong offset!");

// Function DungeonCrawler.AccountLinkAll.UnbindMsg
// 0x0010 (0x0010 - 0x0000)
struct AccountLinkAll_UnbindMsg final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkAll_UnbindMsg) == 0x000008, "Wrong alignment on AccountLinkAll_UnbindMsg");
static_assert(sizeof(AccountLinkAll_UnbindMsg) == 0x000010, "Wrong size on AccountLinkAll_UnbindMsg");
static_assert(offsetof(AccountLinkAll_UnbindMsg, InMsgType) == 0x000000, "Member 'AccountLinkAll_UnbindMsg::InMsgType' has a wrong offset!");
static_assert(offsetof(AccountLinkAll_UnbindMsg, InObject) == 0x000008, "Member 'AccountLinkAll_UnbindMsg::InObject' has a wrong offset!");

// Function DungeonCrawler.AccountLinkAll.UnbindMsgAll
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkAll_UnbindMsgAll final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkAll_UnbindMsgAll) == 0x000008, "Wrong alignment on AccountLinkAll_UnbindMsgAll");
static_assert(sizeof(AccountLinkAll_UnbindMsgAll) == 0x000008, "Wrong size on AccountLinkAll_UnbindMsgAll");
static_assert(offsetof(AccountLinkAll_UnbindMsgAll, InObject) == 0x000000, "Member 'AccountLinkAll_UnbindMsgAll::InObject' has a wrong offset!");

// Function DungeonCrawler.AccountSession.BroadcastMsgBlueprint
// 0x0004 (0x0004 - 0x0000)
struct AccountSession_BroadcastMsgBlueprint final
{
public:
	int32                                         InMsg;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountSession_BroadcastMsgBlueprint) == 0x000004, "Wrong alignment on AccountSession_BroadcastMsgBlueprint");
static_assert(sizeof(AccountSession_BroadcastMsgBlueprint) == 0x000004, "Wrong size on AccountSession_BroadcastMsgBlueprint");
static_assert(offsetof(AccountSession_BroadcastMsgBlueprint, InMsg) == 0x000000, "Member 'AccountSession_BroadcastMsgBlueprint::InMsg' has a wrong offset!");

// Function DungeonCrawler.AccountSession.UnbindMsg
// 0x0010 (0x0010 - 0x0000)
struct AccountSession_UnbindMsg final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountSession_UnbindMsg) == 0x000008, "Wrong alignment on AccountSession_UnbindMsg");
static_assert(sizeof(AccountSession_UnbindMsg) == 0x000010, "Wrong size on AccountSession_UnbindMsg");
static_assert(offsetof(AccountSession_UnbindMsg, InMsgType) == 0x000000, "Member 'AccountSession_UnbindMsg::InMsgType' has a wrong offset!");
static_assert(offsetof(AccountSession_UnbindMsg, InObject) == 0x000008, "Member 'AccountSession_UnbindMsg::InObject' has a wrong offset!");

// Function DungeonCrawler.AccountSession.UnbindMsgAll
// 0x0008 (0x0008 - 0x0000)
struct AccountSession_UnbindMsgAll final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountSession_UnbindMsgAll) == 0x000008, "Wrong alignment on AccountSession_UnbindMsgAll");
static_assert(sizeof(AccountSession_UnbindMsgAll) == 0x000008, "Wrong size on AccountSession_UnbindMsgAll");
static_assert(offsetof(AccountSession_UnbindMsgAll, InObject) == 0x000000, "Member 'AccountSession_UnbindMsgAll::InObject' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.BindMsgOwner
// 0x0010 (0x0010 - 0x0000)
struct DCWidgetBase_BindMsgOwner final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBindMsgNode*                           InMsgDynamicDelegate;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_BindMsgOwner) == 0x000008, "Wrong alignment on DCWidgetBase_BindMsgOwner");
static_assert(sizeof(DCWidgetBase_BindMsgOwner) == 0x000010, "Wrong size on DCWidgetBase_BindMsgOwner");
static_assert(offsetof(DCWidgetBase_BindMsgOwner, InMsgType) == 0x000000, "Member 'DCWidgetBase_BindMsgOwner::InMsgType' has a wrong offset!");
static_assert(offsetof(DCWidgetBase_BindMsgOwner, InMsgDynamicDelegate) == 0x000008, "Member 'DCWidgetBase_BindMsgOwner::InMsgDynamicDelegate' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.BroadcastMsgBlueprint
// 0x0004 (0x0004 - 0x0000)
struct DCWidgetBase_BroadcastMsgBlueprint final
{
public:
	int32                                         InMsg;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_BroadcastMsgBlueprint) == 0x000004, "Wrong alignment on DCWidgetBase_BroadcastMsgBlueprint");
static_assert(sizeof(DCWidgetBase_BroadcastMsgBlueprint) == 0x000004, "Wrong size on DCWidgetBase_BroadcastMsgBlueprint");
static_assert(offsetof(DCWidgetBase_BroadcastMsgBlueprint, InMsg) == 0x000000, "Member 'DCWidgetBase_BroadcastMsgBlueprint::InMsg' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.GetOwningBaseInterfaceBlueprint
// 0x0010 (0x0010 - 0x0000)
struct DCWidgetBase_GetOwningBaseInterfaceBlueprint final
{
public:
	TScriptInterface<class IBaseInterface>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_GetOwningBaseInterfaceBlueprint) == 0x000008, "Wrong alignment on DCWidgetBase_GetOwningBaseInterfaceBlueprint");
static_assert(sizeof(DCWidgetBase_GetOwningBaseInterfaceBlueprint) == 0x000010, "Wrong size on DCWidgetBase_GetOwningBaseInterfaceBlueprint");
static_assert(offsetof(DCWidgetBase_GetOwningBaseInterfaceBlueprint, ReturnValue) == 0x000000, "Member 'DCWidgetBase_GetOwningBaseInterfaceBlueprint::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.IsSpectating
// 0x0001 (0x0001 - 0x0000)
struct DCWidgetBase_IsSpectating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_IsSpectating) == 0x000001, "Wrong alignment on DCWidgetBase_IsSpectating");
static_assert(sizeof(DCWidgetBase_IsSpectating) == 0x000001, "Wrong size on DCWidgetBase_IsSpectating");
static_assert(offsetof(DCWidgetBase_IsSpectating, ReturnValue) == 0x000000, "Member 'DCWidgetBase_IsSpectating::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.UnbindMsg
// 0x0010 (0x0010 - 0x0000)
struct DCWidgetBase_UnbindMsg final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_UnbindMsg) == 0x000008, "Wrong alignment on DCWidgetBase_UnbindMsg");
static_assert(sizeof(DCWidgetBase_UnbindMsg) == 0x000010, "Wrong size on DCWidgetBase_UnbindMsg");
static_assert(offsetof(DCWidgetBase_UnbindMsg, InMsgType) == 0x000000, "Member 'DCWidgetBase_UnbindMsg::InMsgType' has a wrong offset!");
static_assert(offsetof(DCWidgetBase_UnbindMsg, InObject) == 0x000008, "Member 'DCWidgetBase_UnbindMsg::InObject' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.UnbindMsgAll
// 0x0008 (0x0008 - 0x0000)
struct DCWidgetBase_UnbindMsgAll final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_UnbindMsgAll) == 0x000008, "Wrong alignment on DCWidgetBase_UnbindMsgAll");
static_assert(sizeof(DCWidgetBase_UnbindMsgAll) == 0x000008, "Wrong size on DCWidgetBase_UnbindMsgAll");
static_assert(offsetof(DCWidgetBase_UnbindMsgAll, InObject) == 0x000000, "Member 'DCWidgetBase_UnbindMsgAll::InObject' has a wrong offset!");

// Function DungeonCrawler.DCWidgetBase.UnbindMsgOwner
// 0x0008 (0x0008 - 0x0000)
struct DCWidgetBase_UnbindMsgOwner final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCWidgetBase_UnbindMsgOwner) == 0x000008, "Wrong alignment on DCWidgetBase_UnbindMsgOwner");
static_assert(sizeof(DCWidgetBase_UnbindMsgOwner) == 0x000008, "Wrong size on DCWidgetBase_UnbindMsgOwner");
static_assert(offsetof(DCWidgetBase_UnbindMsgOwner, InMsgType) == 0x000000, "Member 'DCWidgetBase_UnbindMsgOwner::InMsgType' has a wrong offset!");

// Function DungeonCrawler.DCInventoryBase.OnRep_Indexes
// 0x0010 (0x0010 - 0x0000)
struct DCInventoryBase_OnRep_Indexes final
{
public:
	TArray<int32>                                 OldIndexes;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCInventoryBase_OnRep_Indexes) == 0x000008, "Wrong alignment on DCInventoryBase_OnRep_Indexes");
static_assert(sizeof(DCInventoryBase_OnRep_Indexes) == 0x000010, "Wrong size on DCInventoryBase_OnRep_Indexes");
static_assert(offsetof(DCInventoryBase_OnRep_Indexes, OldIndexes) == 0x000000, "Member 'DCInventoryBase_OnRep_Indexes::OldIndexes' has a wrong offset!");

// Function DungeonCrawler.DCInventoryBase.OnRep_Version
// 0x0028 (0x0028 - 0x0000)
struct DCInventoryBase_OnRep_Version final
{
public:
	struct FDCInventoryVersion                    OldVersion;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCInventoryBase_OnRep_Version) == 0x000008, "Wrong alignment on DCInventoryBase_OnRep_Version");
static_assert(sizeof(DCInventoryBase_OnRep_Version) == 0x000028, "Wrong size on DCInventoryBase_OnRep_Version");
static_assert(offsetof(DCInventoryBase_OnRep_Version, OldVersion) == 0x000000, "Member 'DCInventoryBase_OnRep_Version::OldVersion' has a wrong offset!");

// Function DungeonCrawler.DCBoxInventory.OnRep_BoxSize
// 0x0008 (0x0008 - 0x0000)
struct DCBoxInventory_OnRep_BoxSize final
{
public:
	struct FIntPoint                              OldBoxSize;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCBoxInventory_OnRep_BoxSize) == 0x000004, "Wrong alignment on DCBoxInventory_OnRep_BoxSize");
static_assert(sizeof(DCBoxInventory_OnRep_BoxSize) == 0x000008, "Wrong size on DCBoxInventory_OnRep_BoxSize");
static_assert(offsetof(DCBoxInventory_OnRep_BoxSize, OldBoxSize) == 0x000000, "Member 'DCBoxInventory_OnRep_BoxSize::OldBoxSize' has a wrong offset!");

// Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.GetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct GameMenuOptionsVideosSlotWidget_GetQualityLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameMenuOptionsVideosSlotWidget_GetQualityLevel) == 0x000004, "Wrong alignment on GameMenuOptionsVideosSlotWidget_GetQualityLevel");
static_assert(sizeof(GameMenuOptionsVideosSlotWidget_GetQualityLevel) == 0x000004, "Wrong size on GameMenuOptionsVideosSlotWidget_GetQualityLevel");
static_assert(offsetof(GameMenuOptionsVideosSlotWidget_GetQualityLevel, ReturnValue) == 0x000000, "Member 'GameMenuOptionsVideosSlotWidget_GetQualityLevel::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnQualityLevel
// 0x0008 (0x0008 - 0x0000)
struct GameMenuOptionsVideosSlotWidget_OnQualityLevel final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldValue;                                          // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameMenuOptionsVideosSlotWidget_OnQualityLevel) == 0x000004, "Wrong alignment on GameMenuOptionsVideosSlotWidget_OnQualityLevel");
static_assert(sizeof(GameMenuOptionsVideosSlotWidget_OnQualityLevel) == 0x000008, "Wrong size on GameMenuOptionsVideosSlotWidget_OnQualityLevel");
static_assert(offsetof(GameMenuOptionsVideosSlotWidget_OnQualityLevel, NewValue) == 0x000000, "Member 'GameMenuOptionsVideosSlotWidget_OnQualityLevel::NewValue' has a wrong offset!");
static_assert(offsetof(GameMenuOptionsVideosSlotWidget_OnQualityLevel, OldValue) == 0x000004, "Member 'GameMenuOptionsVideosSlotWidget_OnQualityLevel::OldValue' has a wrong offset!");

// Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.SetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct GameMenuOptionsVideosSlotWidget_SetQualityLevel final
{
public:
	int32                                         InQualityLevel;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameMenuOptionsVideosSlotWidget_SetQualityLevel) == 0x000004, "Wrong alignment on GameMenuOptionsVideosSlotWidget_SetQualityLevel");
static_assert(sizeof(GameMenuOptionsVideosSlotWidget_SetQualityLevel) == 0x000004, "Wrong size on GameMenuOptionsVideosSlotWidget_SetQualityLevel");
static_assert(offsetof(GameMenuOptionsVideosSlotWidget_SetQualityLevel, InQualityLevel) == 0x000000, "Member 'GameMenuOptionsVideosSlotWidget_SetQualityLevel::InQualityLevel' has a wrong offset!");

// Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct GameMenuOptionsVideosSlotWidget_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameMenuOptionsVideosSlotWidget_SetTitle) == 0x000008, "Wrong alignment on GameMenuOptionsVideosSlotWidget_SetTitle");
static_assert(sizeof(GameMenuOptionsVideosSlotWidget_SetTitle) == 0x000018, "Wrong size on GameMenuOptionsVideosSlotWidget_SetTitle");
static_assert(offsetof(GameMenuOptionsVideosSlotWidget_SetTitle, InTitle) == 0x000000, "Member 'GameMenuOptionsVideosSlotWidget_SetTitle::InTitle' has a wrong offset!");

// Function DungeonCrawler.ArenaSelectSlotWidget.OnGameUserSettingControlsChanged
// 0x0088 (0x0088 - 0x0000)
struct ArenaSelectSlotWidget_OnGameUserSettingControlsChanged final
{
public:
	struct FGameUserSettingControls               InGameUserSettingControls;                         // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameUserSettingControls               InOldGameUserSettingControls;                      // 0x0040(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bInForce;                                          // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2357[0x7];                                     // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArenaSelectSlotWidget_OnGameUserSettingControlsChanged) == 0x000008, "Wrong alignment on ArenaSelectSlotWidget_OnGameUserSettingControlsChanged");
static_assert(sizeof(ArenaSelectSlotWidget_OnGameUserSettingControlsChanged) == 0x000088, "Wrong size on ArenaSelectSlotWidget_OnGameUserSettingControlsChanged");
static_assert(offsetof(ArenaSelectSlotWidget_OnGameUserSettingControlsChanged, InGameUserSettingControls) == 0x000000, "Member 'ArenaSelectSlotWidget_OnGameUserSettingControlsChanged::InGameUserSettingControls' has a wrong offset!");
static_assert(offsetof(ArenaSelectSlotWidget_OnGameUserSettingControlsChanged, InOldGameUserSettingControls) == 0x000040, "Member 'ArenaSelectSlotWidget_OnGameUserSettingControlsChanged::InOldGameUserSettingControls' has a wrong offset!");
static_assert(offsetof(ArenaSelectSlotWidget_OnGameUserSettingControlsChanged, bInForce) == 0x000080, "Member 'ArenaSelectSlotWidget_OnGameUserSettingControlsChanged::bInForce' has a wrong offset!");

// Function DungeonCrawler.ArenaSelectSlotWidget.CanJoin
// 0x0001 (0x0001 - 0x0000)
struct ArenaSelectSlotWidget_CanJoin final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArenaSelectSlotWidget_CanJoin) == 0x000001, "Wrong alignment on ArenaSelectSlotWidget_CanJoin");
static_assert(sizeof(ArenaSelectSlotWidget_CanJoin) == 0x000001, "Wrong size on ArenaSelectSlotWidget_CanJoin");
static_assert(offsetof(ArenaSelectSlotWidget_CanJoin, ReturnValue) == 0x000000, "Member 'ArenaSelectSlotWidget_CanJoin::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.ArenaSelectSlotWidget.GetBeginTime
// 0x0008 (0x0008 - 0x0000)
struct ArenaSelectSlotWidget_GetBeginTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArenaSelectSlotWidget_GetBeginTime) == 0x000008, "Wrong alignment on ArenaSelectSlotWidget_GetBeginTime");
static_assert(sizeof(ArenaSelectSlotWidget_GetBeginTime) == 0x000008, "Wrong size on ArenaSelectSlotWidget_GetBeginTime");
static_assert(offsetof(ArenaSelectSlotWidget_GetBeginTime, ReturnValue) == 0x000000, "Member 'ArenaSelectSlotWidget_GetBeginTime::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.ArenaSelectSlotWidget.GetEndTime
// 0x0008 (0x0008 - 0x0000)
struct ArenaSelectSlotWidget_GetEndTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArenaSelectSlotWidget_GetEndTime) == 0x000008, "Wrong alignment on ArenaSelectSlotWidget_GetEndTime");
static_assert(sizeof(ArenaSelectSlotWidget_GetEndTime) == 0x000008, "Wrong size on ArenaSelectSlotWidget_GetEndTime");
static_assert(offsetof(ArenaSelectSlotWidget_GetEndTime, ReturnValue) == 0x000000, "Member 'ArenaSelectSlotWidget_GetEndTime::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameModeAIControllerBase.BroadcastMsgBlueprint
// 0x0004 (0x0004 - 0x0000)
struct DCGameModeAIControllerBase_BroadcastMsgBlueprint final
{
public:
	int32                                         InMsg;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameModeAIControllerBase_BroadcastMsgBlueprint) == 0x000004, "Wrong alignment on DCGameModeAIControllerBase_BroadcastMsgBlueprint");
static_assert(sizeof(DCGameModeAIControllerBase_BroadcastMsgBlueprint) == 0x000004, "Wrong size on DCGameModeAIControllerBase_BroadcastMsgBlueprint");
static_assert(offsetof(DCGameModeAIControllerBase_BroadcastMsgBlueprint, InMsg) == 0x000000, "Member 'DCGameModeAIControllerBase_BroadcastMsgBlueprint::InMsg' has a wrong offset!");

// Function DungeonCrawler.DCGameModeAIControllerBase.UnbindMsg
// 0x0010 (0x0010 - 0x0000)
struct DCGameModeAIControllerBase_UnbindMsg final
{
public:
	class UScriptStruct*                          InMsgType;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameModeAIControllerBase_UnbindMsg) == 0x000008, "Wrong alignment on DCGameModeAIControllerBase_UnbindMsg");
static_assert(sizeof(DCGameModeAIControllerBase_UnbindMsg) == 0x000010, "Wrong size on DCGameModeAIControllerBase_UnbindMsg");
static_assert(offsetof(DCGameModeAIControllerBase_UnbindMsg, InMsgType) == 0x000000, "Member 'DCGameModeAIControllerBase_UnbindMsg::InMsgType' has a wrong offset!");
static_assert(offsetof(DCGameModeAIControllerBase_UnbindMsg, InObject) == 0x000008, "Member 'DCGameModeAIControllerBase_UnbindMsg::InObject' has a wrong offset!");

// Function DungeonCrawler.DCGameModeAIControllerBase.UnbindMsgAll
// 0x0008 (0x0008 - 0x0000)
struct DCGameModeAIControllerBase_UnbindMsgAll final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameModeAIControllerBase_UnbindMsgAll) == 0x000008, "Wrong alignment on DCGameModeAIControllerBase_UnbindMsgAll");
static_assert(sizeof(DCGameModeAIControllerBase_UnbindMsgAll) == 0x000008, "Wrong size on DCGameModeAIControllerBase_UnbindMsgAll");
static_assert(offsetof(DCGameModeAIControllerBase_UnbindMsgAll, InObject) == 0x000000, "Member 'DCGameModeAIControllerBase_UnbindMsgAll::InObject' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.AddGameplayCue
// 0x0020 (0x0020 - 0x0000)
struct DCGameplayAbilityBase_AddGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_AddGameplayCue) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_AddGameplayCue");
static_assert(sizeof(DCGameplayAbilityBase_AddGameplayCue) == 0x000020, "Wrong size on DCGameplayAbilityBase_AddGameplayCue");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCue, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_AddGameplayCue::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCue, EffectContext) == 0x000008, "Member 'DCGameplayAbilityBase_AddGameplayCue::EffectContext' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.AddGameplayCueLocal
// 0x0020 (0x0020 - 0x0000)
struct DCGameplayAbilityBase_AddGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_AddGameplayCueLocal) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_AddGameplayCueLocal");
static_assert(sizeof(DCGameplayAbilityBase_AddGameplayCueLocal) == 0x000020, "Wrong size on DCGameplayAbilityBase_AddGameplayCueLocal");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueLocal, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_AddGameplayCueLocal::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueLocal, EffectContext) == 0x000008, "Member 'DCGameplayAbilityBase_AddGameplayCueLocal::EffectContext' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.AddGameplayCueLocalWithParams
// 0x00E0 (0x00E0 - 0x0000)
struct DCGameplayAbilityBase_AddGameplayCueLocalWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Params_0;                                          // 0x0008(0x00D8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_AddGameplayCueLocalWithParams) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_AddGameplayCueLocalWithParams");
static_assert(sizeof(DCGameplayAbilityBase_AddGameplayCueLocalWithParams) == 0x0000E0, "Wrong size on DCGameplayAbilityBase_AddGameplayCueLocalWithParams");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueLocalWithParams, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_AddGameplayCueLocalWithParams::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueLocalWithParams, Params_0) == 0x000008, "Member 'DCGameplayAbilityBase_AddGameplayCueLocalWithParams::Params_0' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.AddGameplayCueWithParams
// 0x00E0 (0x00E0 - 0x0000)
struct DCGameplayAbilityBase_AddGameplayCueWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Params_0;                                          // 0x0008(0x00D8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_AddGameplayCueWithParams) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_AddGameplayCueWithParams");
static_assert(sizeof(DCGameplayAbilityBase_AddGameplayCueWithParams) == 0x0000E0, "Wrong size on DCGameplayAbilityBase_AddGameplayCueWithParams");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueWithParams, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_AddGameplayCueWithParams::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_AddGameplayCueWithParams, Params_0) == 0x000008, "Member 'DCGameplayAbilityBase_AddGameplayCueWithParams::Params_0' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ApplyEffectContainer
// 0x00D8 (0x00D8 - 0x0000)
struct DCGameplayAbilityBase_ApplyEffectContainer final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OverrideGameplayLevel;                             // 0x00B8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InCountToApply;                                    // 0x00BC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsApplyTargetSelf;                                // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235B[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x00C8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ApplyEffectContainer) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ApplyEffectContainer");
static_assert(sizeof(DCGameplayAbilityBase_ApplyEffectContainer) == 0x0000D8, "Wrong size on DCGameplayAbilityBase_ApplyEffectContainer");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, ContainerTag) == 0x000000, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, EventData) == 0x000008, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, OverrideGameplayLevel) == 0x0000B8, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::OverrideGameplayLevel' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, InCountToApply) == 0x0000BC, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::InCountToApply' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, bIsApplyTargetSelf) == 0x0000C0, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::bIsApplyTargetSelf' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainer, ReturnValue) == 0x0000C8, "Member 'DCGameplayAbilityBase_ApplyEffectContainer::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ApplyEffectContainerSpec
// 0x0060 (0x0060 - 0x0000)
struct DCGameplayAbilityBase_ApplyEffectContainerSpec final
{
public:
	struct FDCGameplayEffectContainerSpec         ContainerSpec;                                     // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InCountToApply;                                    // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsApplyTargetSelf;                                // 0x004C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ApplyEffectContainerSpec) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ApplyEffectContainerSpec");
static_assert(sizeof(DCGameplayAbilityBase_ApplyEffectContainerSpec) == 0x000060, "Wrong size on DCGameplayAbilityBase_ApplyEffectContainerSpec");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpec, ContainerSpec) == 0x000000, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpec::ContainerSpec' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpec, InCountToApply) == 0x000048, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpec::InCountToApply' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpec, bIsApplyTargetSelf) == 0x00004C, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpec::bIsApplyTargetSelf' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpec, ReturnValue) == 0x000050, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpec::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ApplyEffectContainerSpecArray
// 0x00D8 (0x00D8 - 0x0000)
struct DCGameplayAbilityBase_ApplyEffectContainerSpecArray final
{
public:
	TArray<struct FDCGameplayEffectContainerSpec> OutContainerSpecArray;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ContainerTag;                                      // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0018(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x00C8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ApplyEffectContainerSpecArray");
static_assert(sizeof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray) == 0x0000D8, "Wrong size on DCGameplayAbilityBase_ApplyEffectContainerSpecArray");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray, OutContainerSpecArray) == 0x000000, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpecArray::OutContainerSpecArray' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray, ContainerTag) == 0x000010, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpecArray::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray, EventData) == 0x000018, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpecArray::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyEffectContainerSpecArray, ReturnValue) == 0x0000C8, "Member 'DCGameplayAbilityBase_ApplyEffectContainerSpecArray::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ApplyMovementModifier
// 0x0008 (0x0008 - 0x0000)
struct DCGameplayAbilityBase_ApplyMovementModifier final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ApplyMovementModifier) == 0x000004, "Wrong alignment on DCGameplayAbilityBase_ApplyMovementModifier");
static_assert(sizeof(DCGameplayAbilityBase_ApplyMovementModifier) == 0x000008, "Wrong size on DCGameplayAbilityBase_ApplyMovementModifier");
static_assert(offsetof(DCGameplayAbilityBase_ApplyMovementModifier, EventTag) == 0x000000, "Member 'DCGameplayAbilityBase_ApplyMovementModifier::EventTag' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ApplyPremadeSpecArray
// 0x00C8 (0x00C8 - 0x0000)
struct DCGameplayAbilityBase_ApplyPremadeSpecArray final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x00B8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ApplyPremadeSpecArray) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ApplyPremadeSpecArray");
static_assert(sizeof(DCGameplayAbilityBase_ApplyPremadeSpecArray) == 0x0000C8, "Wrong size on DCGameplayAbilityBase_ApplyPremadeSpecArray");
static_assert(offsetof(DCGameplayAbilityBase_ApplyPremadeSpecArray, ContainerTag) == 0x000000, "Member 'DCGameplayAbilityBase_ApplyPremadeSpecArray::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyPremadeSpecArray, EventData) == 0x000008, "Member 'DCGameplayAbilityBase_ApplyPremadeSpecArray::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ApplyPremadeSpecArray, ReturnValue) == 0x0000B8, "Member 'DCGameplayAbilityBase_ApplyPremadeSpecArray::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.CopyPremadeSpecArray
// 0x0008 (0x0008 - 0x0000)
struct DCGameplayAbilityBase_CopyPremadeSpecArray final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_CopyPremadeSpecArray) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_CopyPremadeSpecArray");
static_assert(sizeof(DCGameplayAbilityBase_CopyPremadeSpecArray) == 0x000008, "Wrong size on DCGameplayAbilityBase_CopyPremadeSpecArray");
static_assert(offsetof(DCGameplayAbilityBase_CopyPremadeSpecArray, InActor) == 0x000000, "Member 'DCGameplayAbilityBase_CopyPremadeSpecArray::InActor' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ExecuteGameplayCue
// 0x0020 (0x0020 - 0x0000)
struct DCGameplayAbilityBase_ExecuteGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ExecuteGameplayCue) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ExecuteGameplayCue");
static_assert(sizeof(DCGameplayAbilityBase_ExecuteGameplayCue) == 0x000020, "Wrong size on DCGameplayAbilityBase_ExecuteGameplayCue");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCue, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_ExecuteGameplayCue::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCue, EffectContext) == 0x000008, "Member 'DCGameplayAbilityBase_ExecuteGameplayCue::EffectContext' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ExecuteGameplayCueLocal
// 0x0020 (0x0020 - 0x0000)
struct DCGameplayAbilityBase_ExecuteGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ExecuteGameplayCueLocal) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ExecuteGameplayCueLocal");
static_assert(sizeof(DCGameplayAbilityBase_ExecuteGameplayCueLocal) == 0x000020, "Wrong size on DCGameplayAbilityBase_ExecuteGameplayCueLocal");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueLocal, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueLocal::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueLocal, EffectContext) == 0x000008, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueLocal::EffectContext' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ExecuteGameplayCueLocalWithParams
// 0x00E0 (0x00E0 - 0x0000)
struct DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Params_0;                                          // 0x0008(0x00D8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams");
static_assert(sizeof(DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams) == 0x0000E0, "Wrong size on DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams, Params_0) == 0x000008, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueLocalWithParams::Params_0' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.ExecuteGameplayCueWithParams
// 0x00E0 (0x00E0 - 0x0000)
struct DCGameplayAbilityBase_ExecuteGameplayCueWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Params_0;                                          // 0x0008(0x00D8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_ExecuteGameplayCueWithParams) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_ExecuteGameplayCueWithParams");
static_assert(sizeof(DCGameplayAbilityBase_ExecuteGameplayCueWithParams) == 0x0000E0, "Wrong size on DCGameplayAbilityBase_ExecuteGameplayCueWithParams");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueWithParams, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueWithParams::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_ExecuteGameplayCueWithParams, Params_0) == 0x000008, "Member 'DCGameplayAbilityBase_ExecuteGameplayCueWithParams::Params_0' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.GetEffectAssetTagsInEffectContainerArray
// 0x0028 (0x0028 - 0x0000)
struct DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray final
{
public:
	struct FGameplayTag                           InContainerTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray");
static_assert(sizeof(DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray) == 0x000028, "Wrong size on DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray");
static_assert(offsetof(DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray, InContainerTag) == 0x000000, "Member 'DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray::InContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray, ReturnValue) == 0x000008, "Member 'DCGameplayAbilityBase_GetEffectAssetTagsInEffectContainerArray::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.GetGameplayTriggerTag
// 0x000C (0x000C - 0x0000)
struct DCGameplayAbilityBase_GetGameplayTriggerTag final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_GetGameplayTriggerTag) == 0x000004, "Wrong alignment on DCGameplayAbilityBase_GetGameplayTriggerTag");
static_assert(sizeof(DCGameplayAbilityBase_GetGameplayTriggerTag) == 0x00000C, "Wrong size on DCGameplayAbilityBase_GetGameplayTriggerTag");
static_assert(offsetof(DCGameplayAbilityBase_GetGameplayTriggerTag, Param_Index) == 0x000000, "Member 'DCGameplayAbilityBase_GetGameplayTriggerTag::Param_Index' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_GetGameplayTriggerTag, ReturnValue) == 0x000004, "Member 'DCGameplayAbilityBase_GetGameplayTriggerTag::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.GetSetByCallerValueInEffectContainerArray
// 0x0014 (0x0014 - 0x0000)
struct DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SetByCallerDataTag;                                // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray) == 0x000004, "Wrong alignment on DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray");
static_assert(sizeof(DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray) == 0x000014, "Wrong size on DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray");
static_assert(offsetof(DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray, ContainerTag) == 0x000000, "Member 'DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray, SetByCallerDataTag) == 0x000008, "Member 'DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray::SetByCallerDataTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray, ReturnValue) == 0x000010, "Member 'DCGameplayAbilityBase_GetSetByCallerValueInEffectContainerArray::ReturnValue' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.MakeEffectContainerPremadeSpec
// 0x00C8 (0x00C8 - 0x0000)
struct DCGameplayAbilityBase_MakeEffectContainerPremadeSpec final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ContainerTag;                                      // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0010(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OverrideGameplayLevel;                             // 0x00C0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235D[0x4];                                     // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_MakeEffectContainerPremadeSpec");
static_assert(sizeof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec) == 0x0000C8, "Wrong size on DCGameplayAbilityBase_MakeEffectContainerPremadeSpec");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec, InActor) == 0x000000, "Member 'DCGameplayAbilityBase_MakeEffectContainerPremadeSpec::InActor' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec, ContainerTag) == 0x000008, "Member 'DCGameplayAbilityBase_MakeEffectContainerPremadeSpec::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec, EventData) == 0x000010, "Member 'DCGameplayAbilityBase_MakeEffectContainerPremadeSpec::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerPremadeSpec, OverrideGameplayLevel) == 0x0000C0, "Member 'DCGameplayAbilityBase_MakeEffectContainerPremadeSpec::OverrideGameplayLevel' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.MakeEffectContainerSpec
// 0x00D0 (0x00D0 - 0x0000)
struct DCGameplayAbilityBase_MakeEffectContainerSpec final
{
public:
	TArray<struct FDCGameplayEffectContainerSpec> OutContainerSpecArray;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ContainerTag;                                      // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0018(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OverrideGameplayLevel;                             // 0x00C8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235E[0x4];                                     // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DCGameplayAbilityBase_MakeEffectContainerSpec) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_MakeEffectContainerSpec");
static_assert(sizeof(DCGameplayAbilityBase_MakeEffectContainerSpec) == 0x0000D0, "Wrong size on DCGameplayAbilityBase_MakeEffectContainerSpec");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpec, OutContainerSpecArray) == 0x000000, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpec::OutContainerSpecArray' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpec, ContainerTag) == 0x000010, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpec::ContainerTag' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpec, EventData) == 0x000018, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpec::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpec, OverrideGameplayLevel) == 0x0000C8, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpec::OverrideGameplayLevel' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.MakeEffectContainerSpecFromContainer
// 0x0140 (0x0140 - 0x0000)
struct DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer final
{
public:
	TArray<struct FDCGameplayEffectContainerSpec> OutContainerSpecArray;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDCGameplayEffectContainer             Container;                                         // 0x0010(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     EventData;                                         // 0x0088(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OverrideGameplayLevel;                             // 0x0138(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235F[0x4];                                     // 0x013C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer) == 0x000008, "Wrong alignment on DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer");
static_assert(sizeof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer) == 0x000140, "Wrong size on DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer, OutContainerSpecArray) == 0x000000, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer::OutContainerSpecArray' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer, Container) == 0x000010, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer::Container' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer, EventData) == 0x000088, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer::EventData' has a wrong offset!");
static_assert(offsetof(DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer, OverrideGameplayLevel) == 0x000138, "Member 'DCGameplayAbilityBase_MakeEffectContainerSpecFromContainer::OverrideGameplayLevel' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.RemoveGameplayCue
// 0x0008 (0x0008 - 0x0000)
struct DCGameplayAbilityBase_RemoveGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DCGameplayAbilityBase_RemoveGameplayCue) == 0x000004, "Wrong alignment on DCGameplayAbilityBase_RemoveGameplayCue");
static_assert(sizeof(DCGameplayAbilityBase_RemoveGameplayCue) == 0x000008, "Wrong size on DCGameplayAbilityBase_RemoveGameplayCue");
static_assert(offsetof(DCGameplayAbilityBase_RemoveGameplayCue, GameplayCueTag) == 0x000000, "Member 'DCGameplayAbilityBase_RemoveGameplayCue::GameplayCueTag' has a wrong offset!");

// Function DungeonCrawler.DCGameplayAbilityBase.RemoveGameplayCueLocal
// 0x0008 (0x0008 - 0x0000)
