#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonsterBPLibrary

#include "Basic.hpp"

#include "DungeonCrawler_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_Direction_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ModeType_structs.hpp"
#include "E_DistanceFromVariables_structs.hpp"
#include "E_SensorType_structs.hpp"


namespace SDK::Params
{

// Function MonsterBPLibrary.MonsterBPLibrary_C.Actor Has AI Timer
// 0x0040 (0x0040 - 0x0000)
struct MonsterBPLibrary_C_Actor_Has_AI_Timer final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Timer_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Timer_Tag;                                         // 0x001C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392F[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Actor_Has_AI_Timer) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Actor_Has_AI_Timer");
static_assert(sizeof(MonsterBPLibrary_C_Actor_Has_AI_Timer) == 0x000040, "Wrong size on MonsterBPLibrary_C_Actor_Has_AI_Timer");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, Actor) == 0x000000, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::Actor' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, Timer_Index) == 0x000008, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::Timer_Index' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, __WorldContext) == 0x000010, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, Return_Value) == 0x000018, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::Return_Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, Timer_Tag) == 0x00001C, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::Timer_Tag' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, Temp_bool_Variable) == 0x000024, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, K2Node_SwitchInteger_CmpSuccess) == 0x000025, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, K2Node_DynamicCast_As_________________) == 0x000028, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::K2Node_DynamicCast_As_________________' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Actor_Has_AI_Timer, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000039, "Member 'MonsterBPLibrary_C_Actor_Has_AI_Timer::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Add AI Timer
// 0x0048 (0x0048 - 0x0000)
struct MonsterBPLibrary_C_Add_AI_Timer final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Timer_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3930[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Second;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        Timer_Asset;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3931[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_Change_GE_Attribute_And_Apply_Return_Value; // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(MonsterBPLibrary_C_Add_AI_Timer) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Add_AI_Timer");
static_assert(sizeof(MonsterBPLibrary_C_Add_AI_Timer) == 0x000048, "Wrong size on MonsterBPLibrary_C_Add_AI_Timer");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, Actor) == 0x000000, "Member 'MonsterBPLibrary_C_Add_AI_Timer::Actor' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, Timer_Index) == 0x000008, "Member 'MonsterBPLibrary_C_Add_AI_Timer::Timer_Index' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, Second) == 0x000010, "Member 'MonsterBPLibrary_C_Add_AI_Timer::Second' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, __WorldContext) == 0x000018, "Member 'MonsterBPLibrary_C_Add_AI_Timer::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, Timer_Asset) == 0x000020, "Member 'MonsterBPLibrary_C_Add_AI_Timer::Timer_Asset' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'MonsterBPLibrary_C_Add_AI_Timer::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Add_AI_Timer, CallFunc_Change_GE_Attribute_And_Apply_Return_Value) == 0x000038, "Member 'MonsterBPLibrary_C_Add_AI_Timer::CallFunc_Change_GE_Attribute_And_Apply_Return_Value' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Change GE Attribute And Apply
// 0x03C0 (0x03C0 - 0x0000)
struct MonsterBPLibrary_C_Change_GE_Attribute_And_Apply final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_Actor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        Gameplay_Effect;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Set_By_Caller_Tag;                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    Return_Value;                                      // 0x0038(0x0010)(Parm, OutParm)
	TArray<struct FDCGameplayEffectSetByCallerData> OverrideSetByCallerDataArray;                      // 0x0048(0x0010)(Edit, BlueprintVisible)
	struct FDCGameplayEffectData                  Local_Out_Gameplay_Effect_Data;                    // 0x0058(0x0068)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3932[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDesignDataGameplayEffect              CallFunc_GetDesignDataGameplayEffect_ReturnValue;  // 0x00C8(0x02A0)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDCGameplayEffectData>          K2Node_MakeArray_Array;                            // 0x0370(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffects_ReturnValue;         // 0x0380(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDCGameplayEffectSetByCallerData       CallFunc_Array_Get_Item;                           // 0x0394(0x000C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3933[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDCGameplayEffectSetByCallerData       K2Node_MakeStruct_DCGameplayEffectSetByCallerData; // 0x03A8(0x000C)(NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3934[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_SetByCallerValue_ImplicitCast;   // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Change_GE_Attribute_And_Apply");
static_assert(sizeof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply) == 0x0003C0, "Wrong size on MonsterBPLibrary_C_Change_GE_Attribute_And_Apply");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, SourceActor) == 0x000000, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::SourceActor' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Target_Actor) == 0x000008, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Target_Actor' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Gameplay_Effect) == 0x000010, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Gameplay_Effect' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Set_By_Caller_Tag) == 0x000020, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Set_By_Caller_Tag' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Value) == 0x000028, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, __WorldContext) == 0x000030, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Return_Value) == 0x000038, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Return_Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, OverrideSetByCallerDataArray) == 0x000048, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::OverrideSetByCallerDataArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Local_Out_Gameplay_Effect_Data) == 0x000058, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Local_Out_Gameplay_Effect_Data' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_GetDesignDataGameplayEffect_ReturnValue) == 0x0000C8, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_GetDesignDataGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Add_IntInt_ReturnValue) == 0x000368, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, Temp_int_Array_Index_Variable) == 0x00036C, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, K2Node_MakeArray_Array) == 0x000370, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_ApplyGameplayEffects_ReturnValue) == 0x000380, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_ApplyGameplayEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Array_Length_ReturnValue) == 0x000390, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Array_Get_Item) == 0x000394, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Less_IntInt_ReturnValue) == 0x0003A0, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Array_Add_ReturnValue) == 0x0003A4, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, K2Node_MakeStruct_DCGameplayEffectSetByCallerData) == 0x0003A8, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::K2Node_MakeStruct_DCGameplayEffectSetByCallerData' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0003B4, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, CallFunc_Array_Add_ReturnValue_1) == 0x0003B8, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Change_GE_Attribute_And_Apply, K2Node_MakeStruct_SetByCallerValue_ImplicitCast) == 0x0003BC, "Member 'MonsterBPLibrary_C_Change_GE_Attribute_And_Apply::K2Node_MakeStruct_SetByCallerValue_ImplicitCast' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Check Target Has State Tags To Lose From Array
// 0x0068 (0x0068 - 0x0000)
struct MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3935[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3936[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0040(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array");
static_assert(sizeof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array) == 0x000068, "Wrong size on MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, Target) == 0x000000, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::Target' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, __WorldContext) == 0x000008, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, Result) == 0x000010, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::Result' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, Temp_bool_Variable) == 0x000011, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, K2Node_DynamicCast_As_________________) == 0x000018, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::K2Node_DynamicCast_As_________________' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, K2Node_MakeArray_Array) == 0x000030, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000040, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000060, "Member 'MonsterBPLibrary_C_Check_Target_Has_State_Tags_To_Lose_From_Array::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Filter Target From CombatArea
// 0x00B8 (0x00B8 - 0x0000)
struct MonsterBPLibrary_C_Filter_Target_From_CombatArea final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FilterDistanceFromSpawnLocation;                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADCCharacterBase*>               TargetArray;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3937[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADCCharacterBase*>               Result;                                            // 0x0040(0x0010)(Parm, OutParm)
	TArray<class ADCCharacterBase*>               LocalTargetArray;                                  // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3938[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADCCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3939[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393A[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Filter_Target_From_CombatArea) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Filter_Target_From_CombatArea");
static_assert(sizeof(MonsterBPLibrary_C_Filter_Target_From_CombatArea) == 0x0000B8, "Wrong size on MonsterBPLibrary_C_Filter_Target_From_CombatArea");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, SpawnLocation) == 0x000000, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::SpawnLocation' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, FilterDistanceFromSpawnLocation) == 0x000018, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::FilterDistanceFromSpawnLocation' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, TargetArray) == 0x000020, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::TargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, __WorldContext) == 0x000030, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, Return_Value) == 0x000038, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::Return_Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, Result) == 0x000040, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::Result' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, LocalTargetArray) == 0x000050, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::LocalTargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, Temp_int_Array_Index_Variable) == 0x000060, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000071, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Array_Get_Item) == 0x000078, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A8, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_CombatArea, CallFunc_Max_ReturnValue) == 0x0000B0, "Member 'MonsterBPLibrary_C_Filter_Target_From_CombatArea::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Filter Target From Spawn Location
// 0x00B8 (0x00B8 - 0x0000)
struct MonsterBPLibrary_C_Filter_Target_From_Spawn_Location final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FilterDistanceFromSpawnLocation;                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADCCharacterBase*>               TargetArray;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADCCharacterBase*>               Result;                                            // 0x0040(0x0010)(Parm, OutParm)
	TArray<class ADCCharacterBase*>               LocalTargetArray;                                  // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393C[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADCCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393D[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393E[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Filter_Target_From_Spawn_Location");
static_assert(sizeof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location) == 0x0000B8, "Wrong size on MonsterBPLibrary_C_Filter_Target_From_Spawn_Location");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, SpawnLocation) == 0x000000, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::SpawnLocation' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, FilterDistanceFromSpawnLocation) == 0x000018, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::FilterDistanceFromSpawnLocation' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, TargetArray) == 0x000020, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::TargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, __WorldContext) == 0x000030, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, Return_Value) == 0x000038, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::Return_Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, Result) == 0x000040, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::Result' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, LocalTargetArray) == 0x000050, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::LocalTargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, Temp_int_Array_Index_Variable) == 0x000060, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000071, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Array_Get_Item) == 0x000078, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A8, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_From_Spawn_Location, CallFunc_Max_ReturnValue) == 0x0000B0, "Member 'MonsterBPLibrary_C_Filter_Target_From_Spawn_Location::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Filter Target Has Aggro
// 0x0078 (0x0078 - 0x0000)
struct MonsterBPLibrary_C_Filter_Target_Has_Aggro final
{
public:
	class ABP_DCMonsterBase_C*                    MonsterBase;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ADCCharacterBase*>               Input_TargetArray;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADCCharacterBase*>               Output_TargetArray;                                // 0x0028(0x0010)(Parm, OutParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3940[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADCCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAggroPoint_bSuccessfully;              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3941[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAggroPoint_ReturnValue;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3942[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3943[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MonsterBPLibrary_C_Filter_Target_Has_Aggro) == 0x000008, "Wrong alignment on MonsterBPLibrary_C_Filter_Target_Has_Aggro");
static_assert(sizeof(MonsterBPLibrary_C_Filter_Target_Has_Aggro) == 0x000078, "Wrong size on MonsterBPLibrary_C_Filter_Target_Has_Aggro");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, MonsterBase) == 0x000000, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::MonsterBase' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, Input_TargetArray) == 0x000008, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::Input_TargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, __WorldContext) == 0x000018, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::__WorldContext' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, Return_Value) == 0x000020, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::Return_Value' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, Output_TargetArray) == 0x000028, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::Output_TargetArray' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Max_ReturnValue) == 0x000048, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Array_Get_Item) == 0x000050, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Array_RemoveItem_ReturnValue) == 0x000058, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_GetAggroPoint_bSuccessfully) == 0x000059, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_GetAggroPoint_bSuccessfully' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_GetAggroPoint_ReturnValue) == 0x00005C, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_GetAggroPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000064, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000068, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006C, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MonsterBPLibrary_C_Filter_Target_Has_Aggro, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'MonsterBPLibrary_C_Filter_Target_Has_Aggro::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function MonsterBPLibrary.MonsterBPLibrary_C.Get Actors In Range And Angle From Location
// 0x01B0 (0x01B0 - 0x0000)
struct MonsterBPLibrary_C_Get_Actors_In_Range_And_Angle_From_Location final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Range;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Direction;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0030(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3944[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADCCharacterBase*>               DCCharacterBase;                                   // 0x0050(0x0010)(Parm, OutParm)
	double                                        Local_Range;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Local_Location;                                    // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Native_Angle;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Native_Direction;                                  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADCCharacterBase*>               TargetArray;                                       // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3945[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Native_Angle_Return_Value;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Native_Angle_Return_Value_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3946[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3947[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3948[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3949[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394A[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADCCharacterBase*                       K2Node_DynamicCast_AsDCCharacter_Base;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
